<template>
    <div>
        <el-dialog
            title="用户协议"
            :visible.sync="dialogVisible"
            :append-to-body="true"
            class="agreement-dialog"
            width="712px"
            :close-on-click-modal="false">
            <div class="title">用户注册和服务协议</div>
            <div class="content">
                欢迎使用平台服务（以下简称“本平台”），请您（以下简称“用户”）在使用本平台服务前，仔细阅读本协议。本协议是用户与本平台之间的法律协议，具有合同效力，请用户认真阅读。用户一旦在本平台注册或使用本平台的任何服务，即表示用户已经完全接受本协议的全部条款。在使用平台服务之前，请用户务必审慎阅读、充分理解本协议(如果用户未满16周岁，或已满16周岁未满18周岁且不能以自己的劳动收入作为主要收入来源的，请在法定监护人的陪同下阅读本协议）各项条款，特别是限制或免除责任条款、隐私保护政策、帐号规则、法律适用和争议解决条款（包括管辖条款），以及其它以加粗加黑或加下划线等显示形式提示用户注意的重要条款，请务必重点查阅。<br />
                一、定义<br />
                1.1 本平台：平台网站服务，由本平台所有及运营。<br />
                1.2 用户：指注册用户，包括个人用户、企业用户及其他组织形式的用户。<br />
                1.3 商品：指用户授权本平台发布的商品信息。<br />
                1.4 服务：本平台为用户提供便捷订单管理，包括但不限于快递单打印、发货单、备货单打印；支持批量打印批量发货，打单发货，留言备注退款提醒，超强筛单，快递派送提示，自由打印，备货、对账单，扫描发货，快递对账等服务，具体服务内容以平台页面为准。用户经营过程中的全部成本及经营风险均由用户承担。<br />
                1.5修改与更新：本平台有权遵照法律法规规定，在必要时修改本协议（包括适时制定并发布其他政策、规则、公告声明），更新后的协议条款将代替原来的协议并在法律规定的期限届满后正式生效，用户可以在相关服务页面查阅最新版本的协议条款。本协议修改后，如果用户继续使用平台服务的，即视为用户已接受修改后的协议。如果用户不接受修改后的协议，则用户有权利停止使用平台服务。<br />
                二、注册与账户<br />
                2.1 用户应遵守中华人民共和国相关法律法规，使用真实身份信息注册账户。<br />
                2.2 本平台有权根据需要要求用户提供有效的身份证件和其他必要文件，以核实用户身份。<br />
                2.3 用户应当对自己账户中的所有行为和事件负法律责任，包括但不限于因用户提供虚假信息或未及时更新信息而导致的损失。<br />
                2.4 平台将根据法律法规的规定为用户提供帐号安全保障责任。用户亦有责任自行负责保管帐号的用户名和密码等信息，并对使用该账户和密码进行的所有活动负责。若用户的帐号可能导致账户遭窃、遗失的情况，用户需要立即通知平台，否则因该等事项引发的法律责任可能由用户自行承担。凡使用平台服务登录帐号和登录凭证的行为，平台服务视为用户本人的操作，操作所产生的电子信息记录均为平台服务用户行为的有效凭据。<br />
                2.5 用户有责任确保在其账户下的所有行为符合本协议的规定以及相关法律法规，否则本平台有权暂停、关闭用户的账户，并由此产生的全部责任由用户承担。<br />
                2.6 用户可以按照平台注册页面提示填写信息，通过注册平台帐号进行登录，同时，平台也支持用户开通子账号（可开通的子账号数量以用户购买的会员套餐相关联，具体信息请以平台会员页面为准），用户账号中的所有订单信息、物流信息、积分等均与子账号共享使用，如用户的失误导致账号订单信息、物流信息、积分等发生管理失误的，由用户承担全部责任，平台不承担任何责任。<br />
                2.7 用户知悉并理解，如不同帐号绑定或关联同一手机号、同一支付账户、同一身份证信息、同一店铺信息、同一设备号或相同收货信息，所述不同帐号将可能被视为关联帐号（即同一用户），在此情况下，本平台有权进行合并或强制注销相关帐号。<br />
                2.8 如果用户需要注销用户的帐号，用户可以联系本平台的客服进行操作，本平台将在核实用户的身份并清理帐号资产、订单信息等，并确认无纠纷争议后，提供帐号注销服务。在注销帐号之后本协议即终止，本平台将停止为用户提供任何服务，用户无法通过该帐号登陆和使用平台服务，和帐号关联的相关虚拟权益（包括但不限于用户身份资格、虚拟积分等全部权益）亦永久消除。<br />
                2.9 用户保证合理地使用平台服务，并接受本协议和本平台适时制定并发布的其他政策、规则、公告声明。<br />
                2.10 行为禁止：用户可在本协议约定的范围内使用平台及服务，用户不得利用平台从事以下行为：<br />
                （1）超出授权或恶意使用平台服务。<br />
                （2）利用平台发表、传送、传播、储存危害国家安全、国家统一、社会稳定的内容，或侮辱诽谤、色情、暴力、引起他人不安及任何违反国家法律法规政策的内容，或者设置含有上述内容的网名、角色名，发布、传送、传播违法广告信息、营销信息及垃圾信息等。<br />
                （3）利用平台侵害他人知识产权、肖像权、隐私权、名誉权、个人信息等合法权利或权益。<br />
                （4）恶意虚构或协助虚构事实、评价等信息或数据。<br />
                （5）进行任何危害计算机网络安全的行为，包括但不限于：使用未经许可的数据或进入未经许可的服务器/账户；未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；未经许可，企图探查、扫描、测试本“软件”系统或网络的弱点或其它实施破坏网络安全的行为；企图干涉、破坏本“软件”系统或网站的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；伪造TCP、IP数据包名称或部分名称；利用平台及服务上传任何病毒、木马，或者蠕虫等危害网络健康的内容。<br />
                （6）对平台进行反向工程、反向编译或反向汇编或以其它方式企图发现平台的源代码和算法，未经许可修改、禁用软件的任何功能或创建基于软件的衍生作品。去除平台或文档上的任何所有权声明或标签，或将其他软件与平台合并。<br />
                （7）进行任何破坏本平台提供服务公平性或者其他影响应用正常秩序的行为，如主动或被动刷分、合伙作弊、使用外挂或者其他的作弊软件、利用BUG（又叫“漏洞”或者“缺陷”）来获得不正当的非法利益，或者利用互联网或其他方式将外挂、作弊软件、BUG公之于众。<br />
                （8）从事其他法律法规、政策及公序良俗、社会公德禁止的行为以及侵犯其他个人、公司、社会团体、组织的合法权益的行为。<br />
                2.11 信息内容规范：为了营造良好网络生态，保障公民、法人和其他组织的合法权益，维护国家安全和公共利益，本平台将根据《中华人民共和国国家安全法》《中华人民共和国网络安全法》《互联网信息服务管理办法》等法律、行政法规，自觉践行社会主义核心价值观，营造清朗的网络空间，并开展的弘扬正能量、处置违法和不良信息等相关活动。用户亦承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等“七条底线”。<br />
                2.12 用户不得制作、复制、发布含有下列内容的违法信息：<br />
                （1）反对宪法所确定的基本原则的。<br />
                （2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的。<br />
                （3）损害国家荣誉和利益的。<br />
                （4）歪曲、丑化、亵渎、否定英雄烈士事迹和精神，以侮辱、诽谤或者其他方式侵害英雄烈士的姓名、肖像、名誉、荣誉的。<br />
                （5）宣扬恐怖主义、极端主义或者煽动实施恐怖活动、极端主义活动的。<br />
                （6）煽动民族仇恨、民族歧视，破坏民族团结的。<br />
                （7）破坏国家宗教政策，宣扬邪教和封建迷信的。<br />
                （8）散布谣言，扰乱经济秩序和社会秩序的。<br />
                （9）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的。<br />
                （10）侮辱或者诽谤他人，侵害他人名誉、隐私和其他合法权益的。<br />
                （11）法律、行政法规禁止的其他内容。<br />
                2.13 本平台也将依法采取措施，防范和抵制制作、复制、发布含有下列内容的不良信息：<br />
                （1）使用夸张标题，内容与标题严重不符的。<br />
                （2）炒作绯闻、丑闻、劣迹等的。<br />
                （3）不当评述自然灾害、重大事故等灾难的。<br />
                （4）带有性暗示、性挑逗等易使人产生性联想的。<br />
                （5）展现血腥、惊悚、残忍等致人身心不适的。<br />
                （6）煽动人群歧视、地域歧视等的。<br />
                （7）宣扬低俗、庸俗、媚俗内容的。<br />
                （8）可能引发未成年人模仿不安全行为和违反社会公德行为、诱导未成年人不良嗜好等的。<br />
                （9）其他对网络生态造成不良影响的内容。<br />
                2.14 未经本平台书面许可，用户不得自行或授权、允许、协助任何第三人对平台中信息内容进行如下行为：<br />
                （1）复制、读取、采用平台的信息内容，用于任何形式的商业用途。<br />
                （2）擅自编辑、整理、编排平台及相关服务的信息内容后在平台及相关服务的源页面以外的渠道进行展示。<br />
                （3）采用不正当方式，自行或协助第三人对平台及相关服务的信息内容产生流量、阅读量或交易引导、转移、劫持等不利影响。<br />
                三、平台服务内容<br />
                3.1 用户可通过平台进行快递单打印、发货单、备货单打印；支持批量打印批量发货，打单发货，留言备注退款提醒，超强筛单，快递派送提示，自由打印，备货、对账单，扫描发货，快递对账等服务，具体服务内容以平台页面为准。<br />
                （1）快递单打印：通过App打印快递单，减少手动填写快递单的时间和错误率。<br />
                （2）发货单打印：通过App打印发货单，方便记录发货数据和管理订单。<br />
                （3）备货单打印：通过App打印备货单，提高仓库备货效率。<br />
                （4）批量打印批量发货：一次性打印多张快递单和发货单，并且支持批量发货。<br />
                （5）打单发货：在App中进行订单管理和发货，方便快捷。<br />
                （6）留言备注：可在订单中添加留言备注，方便和买家或快递员沟通。<br />
                （7）退货提醒：当有退货订单时，App会自动提醒。<br />
                （8）超强筛单：支持对订单进行筛选，方便快捷地查找需要的订单。<br />
                （9）快递派送提示：支持快递派送状态实时更新，及时掌握快递的派送情况。<br />
                （10）自由打印：支持自定义打印快递单和发货单的格式和样式。<br />
                （11）备货、对账单：通过App打印备货单和对账单，管理订单信息和财务信息。<br />
                （12）扫描发货：支持使用摄像头扫描订单二维码快捷发货。<br />
                （13）快递对账：支持对快递费用进行对账，确保快递费用的正确性。<br />
                （14）多店绑定：支持绑定多个店铺，方便管理多个店铺的订单和发货。<br />
                3.2在用户登录平台后，用户可自由选择服务内容，按照平台指引或客服指引操作，浏览、查找并选购平台所展示的商品/服务，为用户实现全流程自动分销（自动采购、自动发货、自动售后）。除此外，用户还可以参加平台组织的各类活动，享受相关信息及技术服务。<br />
                3.3 通过平台，用户可以便捷地进行交易订单的管理，查看用户的订单的状态、售后情况、物流状态。用户可通过平台查看用户的积分信息，包括但不限于积分使用情况、积分购买情况等。<br />
                3.4 在用户浏览平台的过程中，本平台为用户提供了第三方商家商品、服务的信息分类、关键词检索及主动推送商品信息流等功能，以便更好地匹配用户的需求。用户可以对用户感兴趣的商品、服务添加至列表或进行下单发货管理。<br />
                3.5 平台为用户提供对入驻平台中的第三方商家所销售商品、服务进行评价的途径，用户有权基于平台的评价系统中对达成交易的商品、服务进行评价。当然，用户的评价行为及内容应当合法、客观及真实，不应以不正当方式帮助商品、服务提升或贬损信用或利用评价权利而实施威胁、敲诈勒索。平台可以适时制定并发布具体的信用评价规则。<br />
                3.6 平台建立便捷有效的投诉举报机制并将尽最大努力及时受理并处理用户的投诉举报，提供客服服务。<br />
                3.7 为交易达成以及提升用户体验等目的，平台亦将为用户提供更为友好完善的交易规则服务，并优化和引入物流、支付、交收等第三方服务。由此发生的法律关系是由用户和该等第三方服务商之间形成，和平台无关。<br />
                3.8 用户同意并知悉，平台中的具体内容、功能和形式由平台根据实际情况按“现状”实时提供，本平台有权自行确定平台服务的具体内容、功能和形式，有权自行决定增加、变更、中断和停止平台具体的内容、功能和形式。具体以平台实时呈现的服务内容、功能和形式为准。<br />
                3.9 平台所展示的商品均由用户授权本平台发布，用户应当对该商品的真实性、合法性等负责。如应商品不合法合规导致本平台损失的，应由用户承担全部责任。<br />
                3.10 本平台可通过用户授权发布的商品，或根据用户的游览信息、订单信息等为用户推荐第三方平台商品，但该第三平台商品仅为本平台通过数据分析的推荐内容，用户如需对该第三平台商品进行下单、选购等的，用户应自行在该第三平台商品商家的店铺首页或具体商品的详情页中展示或商家自行展示其营业执照或其他法律法规规定需要向用户展示的信息中辨认该商品信息真实性或该商品质量，本平台对推荐的第三平台商品不承担任何责任。<br />
                四、商品发布<br />
                4.1 用户应当遵守中华人民共和国相关法律法规，发布真实、合法的商品信息，不得发布违反法律法规的商品信息。<br />
                4.2 用户应就其发售的商品信息之真实性、准确性、合法性、及时性、完整性等负责，并承担由于用户发布信息不真实、不准确、不完整、不合法或不及时所引发的相关后果。<br />
                4.3 本平台有权拒绝不符合法律法规或本协议规定的商品信息，并有权删除或修改不符合要求的商品信息。<br />
                4.4 用户应当授权本平台以其名义对外广告、宣传、推广及销售商品。<br />
                4.5 用户应当自行对其发货、选购商品进行质量检验，并承担货物在采购、运输、为顾客服务等环节中的责任和损失。<br />
                五、商品订单管理<br />
                4.1 用户须消耗积分使用本平台进行订单管理、下单等服务，具体积分消耗以本平台页面为准。<br />
                4.2用户通过本平台提供账号进行商品采购的，除本平台账号掉线导致不能进行订单售后管理的，本平台不承担任何费用或责任。商品采购的全部费用均由用户直接支付。<br />
                4.3用户在本平台采购时应当保证商品符合国家法律法规及相关标准，不得发送虚假或超出规范的商品。<br />
                4.4用户在本平台管理发货的商品及货物运输保险等相关事宜应于第三方下单平台沟通并已经妥善安排，如在运输过程中出现货损、货丢等问题，由用户自行负责。<br />
                4.5用户在使用本平台服务时，应确保所提供的发货订单的信息和快递信息符合相关法律法规和政策，并且是真实、合法、准确无误的。平台将在提供平台服务时使用该信息，本平台仅在平台服务的正常运作中使用，以保障用户的隐私和利益。用户在使用本平台服务之前，已充分了解并知晓平台将如何使用用户提供的信息。<br />
                五、费用及结算<br />
                5.1 本平台向用户提供商品发货管理等服务，相关费用由用户承担。<br />
                5.2 本平台服务的全部功能的使用为会员制加积分制。<br />
                （1）在使用本平台之前，用户已了解它存在着限时的试用期限。试用期结束后，用户将不能继续使用平台中的商品发货管理、订单管理等功能。为了继续正常使用本平台，用户需要充值会员。会员服务将为用户提供无限制访问本平台中的所有功能的权限，同时还有其他优惠活动、特殊功能等。充值会员可通过多种方式进行，包括按月订阅、按季度订阅、按年订阅等，用户可以选择适合自己的方案。请注意，如果用户长期未充值会员，平台的功能将仍无法正常使用。因此，用户需及时续费，以确保用户能够持续享受本平台带来便利服务。<br />
                （2）平台的服务需要用户充值购买虚拟积分，积分可通过线上通过微信、支付宝支付等方式直接充值购买以及通过平台客服线下充值购买积分，线上、线下的充值方式的积分充值优惠力度不同，用户可通过自身需要进行购买。该积分用于在平台服务，并且只在用户拥有有效会员期内能够使用。如果会员过期，用户将不能使用积分，但一旦会员续购成功，积分将恢复正常使用。需要说明的是，虚拟积分一旦购买就无法退款，请用户在购买之前充分了解积分兑换规则以及使用期限。用户在充值时应仔细核对充值金额和积分兑换数量，以确保充值是符合自身需求。同时，用户与其他用户协商一致的，在与客服充分说明并取得本平台同意后，积分可根据用户需要转移到其他用户账户供其使用。<br />
                （3）积分充值：<br />
                ①　线上充值：人民币1元=10积分。<br />
                ②　线下充值：人民币1元=20积分，平台视用户充值数额可向用户赠送会员，赠送会员仅为用户本账号使用。、<br />
                （4）积分使用：用户每下一单即须消耗3积分，如用户须使用平台其他功能的，须另外叠加消耗积（具体积分消耗以平台页面信息为准）。<br />
                5.3 用户可参与本平台推出活动获取积分或相应奖励，活动内容可通过平台公告或客服了解。<br />
                六、服务终止与解除<br />
                6.1 用户有权随时以向本平台提出书面申请的方式解除与本平台的服务协议，但需在解除协议前清空账户余额及将订单加工完成。<br />
                6.2 用户应保证在服务终止前的所有交易、订单、结算等业务均已完成，并基于交易双方的权益进行处理，不再涉及其他纠纷。<br />
                6.3 本平台有权在发现用户违反本协议、相关规定、违法行为等情形下，立即采取措施暂停、限制、关闭用户使用本平台服务的权利。<br />
                七、保密和隐私<br />
                7.1经由本平台所提供的所有服务、软件、设计及其他图标、文字、图片、音频剪辑，以及软件所包含的所有内容，均属于本平台的财产，受中华人民共和国和国际著作权法的保护。<br />
                7.2 未经本平台的明确书面同意，任何人不得以任何方式使用、复制或传播上述内容或其中的一部分。<br />
                7.3 在使用本平台的服务时，平台会收集用户的个人或企业信息，包括但不限于姓名（名称）、联系方式、地址、性别、年龄、职业等信息。<br />
                7.4 本平台将使用各种合法的方式收集用户的个人信息，并在收集数据时事先告知用户。<br />
                7.5 本平台将竭尽所能保护用户个人信息的保密性，并在符合法律法规规定的前提下对其进行必要的使用、处理、保存和传输。<br />
                7.6 用户同意本平台根据本协议约定对所收集的个人信息进行处理，并同意本平台将相关信息提供给关联公司或合作方，以便本公司向用户提供更好的服务。<br />
                7.7本平台会通过网站公示的方式公开用户已发布、已成交或正在进行的交易信息。<br />
                7.8本平台对于用户提供的所有信息，均予以保密，除非法律法规另有规定或司法部门、政府机关或第三方需要，否则不得向任何第三方透露。<br />
                7.9 信息使用与披露：本平台有权在遵守法律法规的前提下，以明示的方式获取、使用、储存和分享用户的个人信息。本平台不会在未经用户授权时，公开、编辑或透露用户的个人信息及用户保存在本平台这里的非公开内容。<br />
                7.10 用户同意，本平台有权通过cookie等技术收集用户的使用行为信息，并在经过数据脱敏使之不再指向、关联到用户个人的身份信息时，自由使用脱敏后的纯商业数据。当然，用户也可根据自己的偏好删除Cookie，但如果用户这么做，则需要在每一次访问本平台的网站时亲自更改用户设置。<br />
                八、知识产权等权益<br />
                8.1 本平台对平台中所包含的受知识产权或其他法律保护的资料享有相应的权利；除依法由用户享有著作权的内容之外，平台的整体内容的知识产权归本平台或关联公司所有。<br />
                8.2 用户在使用本平台服务时利用平台及服务所发表上传的文字、图片、视频、软件以及表演等原创信息的知识产权归用户所有（或由第三方内容提供方和用户另行约定），但是基于平台运营的需求，用户确认用户对该等信息的发表、上传行为视同为对本平台授权知识产权的使用、复制、传播等权利。<br />
                8.3 基于对数据的合法加工而获得的具有竞争性的数据权益，除法律法规另有规定外，本平台享有独立的使用权益而无须获得用户的同意。<br />
                8.4 关于信息内容的投诉或举报。若用户在使用平台过程中，不慎受到合法权益的侵犯，用户有权通知本平台采取必要措施进行处置。若用户在使用平台过程中，发现存在违法违规或违反本服务相关规则的情况，用户也有权向本平台发起举报，本平台亦会及时采取必要措施（删除、屏蔽、断开链接或限制使用功能等）进行处置。<br />
                8.5 内容维权授权。在法律法规允许的范围内，用户同意并授权本平台就侵犯用户合法权益的行为（包括但不限于私自复制、使用、编辑、抄袭等行为）采取任何形式的法律行动，包括但不限于投诉、诉讼等必要的维权措施。<br />
                九、免责声明<br />
                9.1 本平台对于用户自平台而获得的所有他人、第三方的信息、内容或者广告宣传等任何资讯（以下统称“信息”），除法律明确规定外，不保证真实、准确和完整性。如果任何单位或者个人通过上述“信息”而进行任何行为，用户须自行甄别真伪和谨慎预防风险。用户在接受平台及服务时，有可能会接触到令人不快、不适当或令人厌恶的内容，在任何情况下，本平台均不对任何此等内容承担任何责任。无论何种原因，本平台不对任何非与本平台直接发生的交易或行为承担任何直接、间接、附带或衍生的损失和责任。<br />
                9.2 鉴于互联网服务的特殊性，用户理解并同意本平台在以下情况下无需对用户所遭受的损失（包括但不限于财产、收益、数据资料等方面的损失或其它无形损失）承担责任：<br />
                （1）因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素导致平台及服务障碍不能正常运作；<br />
                （2）由于计算机病毒、木马、其他恶意程序、黑客攻击、电信部门及网络运营公司技术调整或故障、系统维护等原因而造成平台及服务中断或延迟；<br />
                （3）由于法律法规的变更、司法机关及行政机关等的命令、裁定等原因而导致的平台及服务中断、终止或延迟。<br />
                9.3 在任何情况下，非因本平台提供采购账号掉线原因而导致的用户使用本平台服务产生的任何损失或损害（包括但不限于公司利润损失、经营中断、商业信息的丢失或遗漏、任何数据损失、和其他非直接损失或损害），本平台无需负责任何赔偿。<br />
                9.4 本平台不对平台服务的部分或全部因用户不当操作而导致的不正常使用、操作失误、数据丢失、数据泄露等责任承担赔偿责任。<br />
                9.5如果用户违反本协议的任何条款，本平台保留终止或中断平台服务的权利。<br />
                9.6本协议适用中华人民共和国的法律，并且在该法律的范围内解释和执行。如果本协议中任何一条或多条被认为非法、无效或不可执行，那么这些条款将会被视为可分割的且不会影响其他条款的有效性和可执行性。<br />
                9.7本平台有权随时修改本协议，并在平台上公布。修改后的协议会自行生效，并代替之前的协议。用户应及时关注和阅读并遵守本协议。<br />
                9.8本平台仅为用户提供订单管理服务，用户自阅读本协议或实际使用本平台服务之日起即已充分了解并知晓，用户与第三方平台的所有纠纷均与本平台无关，由用户自行承担全部责任。<br />
                9.9本平台有权在任何时候停止或中断服务，且无需通知用户。<br />
                十、违约责任<br />
                10.1 如果本平台发现、收到他人举报或投诉用户违反本协议约定或违反法律法规和国家有关规定的，本平台有权采取警示、冻结、终止、中止、限制使用帐号等功能、解除或终止本协议，或提出损害赔偿等措施。<br />
                10.2 若用户的行为给本平台造成损失的（包括但不限于直接损失、名誉损失、第三方的罚款、索赔等），本平台有权全额向用户追偿，如用户在平台中有保证金、虚拟货币等财产或优惠券等虚拟权益的，本平台有权冻结。<br />
                10.3 本协议终止后，除法律有明确规定外，平台无义务向用户或用户指定的第三方披露用户账户中的任何信息。本协议终止后，平台仍享有下列权利：根据法律规定，继续保存用户留存于平台的的各类信息；对于用户过往的违约行为，平台仍可依据本协议向用户追究违约责任。<br />
                十一、其他<br />
                本协议的解释、效力及争议解决均适用中华人民共和国相关法律法规，如有争议，双方应协商解决；协商不成，应交由广州市天河区人民法院管辖。若本协议的任何条款无效，则不影响本协议的其它条款的效力。<br />
                本协议自用户同意并开始使用本平台服务时生效。用户的电子签名、签章、点击同意等方式均视为该用户对本协议不可撤销的接受和签署。<br />
                本协议的最终解释权归属于本平台。
            </div>
            <span slot="footer">
                <el-button type="primary" @click="onDialogClose">我知道了</el-button>
            </span>
        </el-dialog>
    </div>
</template>

<script>

export default {
    components: {},
    data() {
        return {
            dialogVisible: false
        }
    },
    computed: {},
    methods: {
        showModel () {
            console.log('showModel')
            this.dialogVisible = true
        },
        onDialogClose () {
            this.dialogVisible = false
        }
    },
    //生命周期 - 创建完成（可以访问当前this实例）
    created() {

    },
    //生命周期 - 挂载完成（可以访问DOM元素）
    mounted() {

    },
    //生命周期 - 销毁完成
    destroyed() {},
}
</script>
<style lang="scss" scoped>
.agreement-dialog {
    ::v-deep .el-dialog {
        margin-top: 5vh !important;
        border-radius: 10px;
        .el-dialog__header {
            padding: 15px 20px 15px;
            border-bottom: 1px solid #ededed;
            .el-dialog__title {
                font-size: 15px;
                font-weight: 500;
            }
        }
        .el-dialog__body {
            padding: 20px;
            max-height: 500px;
            overflow-y: scroll;
            .title {
                text-align: center;
                font-size: 20px;
                color: #333;
                font-weight: 500;
                margin-bottom: 20px;
            }
            .content {
                line-height: 20px;
            }
        }
    }
}
</style>